---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ecomes\Documents\GitHub\pystacked\cert\log_cs_pystacked_class.txt
  log type:  text
 opened on:  26 Oct 2021, 22:04:08

. 
. clear all

.  
. if "`c(username)'"=="kahrens" {
.         adopath + "/Users/kahrens/MyProjects/pystacked"
. }

. else if "`c(username)'"=="ecomes" {
.         adopath + "/Users/ecomes/Documents/GitHub/pystacked/cert"
  [1]  (BASE)      "C:\LocalStore\ecomes\Stata16\ado\base/"
  [2]  (SITE)      "C:\LocalStore\ecomes\Stata16\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\LocalStore\ecomes\Dropbox\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\LocalStore\ecomes\Dropbox\Statadat\underid"
  [8]              "C:\LocalStore\ecomes\Dropbox\StataLasso\iclasso"
  [9]              "C:\Users\ecomes\Documents\GitHub\lassopack\lassopack_v141"
  [10]             "C:\Users\ecomes\Documents\GitHub\pdslasso"
  [11]             "C:\Users\ecomes\Documents\GitHub\ddml"
  [12]             "C:\Users\ecomes\Documents\GitHub\pylearn2"
  [13]             "C:\Users\ecomes\Documents\GitHub\pystacked"
  [14]             "/Users/ecomes/Documents/GitHub/pystacked/cert"
. }

. else {
.         net install pystacked, ///
>                 from(https://raw.githubusercontent.com/aahrens1/pystacked/main) repla
> ce
. }

. which pystacked 
C:\Users\ecomes\Documents\GitHub\pystacked\pystacked.ado
*! pystacked v0.1 (first release)
*! last edited: 26oct2021
*! authors: aa/ms

. python: import sklearn

. python: sklearn.__version__
'0.24.2'

. 
. 
. *******************************************************************************
. *** try voting                                                                       
>                                                    ***
. *******************************************************************************
. 
. insheet using https://archive.ics.uci.edu/ml/machine-learning-databases/spambase/spam
> base.data, clear comma
(58 vars, 4,601 obs)

.                                                 
. pystacked v58 v1-v57, type(class) pyseed(123) ///
>                                                         methods(lassocv rf nnet) /// 
>                                                         njobs(4) pipe1(poly2) ///
>                                                         voting voteweights(0.1 .4) //
> /
>                                                         votetype(soft)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  lassocv        |      0.1000000
  rf             |      0.4000000
  nnet           |      0.5000000

.                         
. 
. *******************************************************************************
. *** try other estimators                                                             
>                                            ***
. *******************************************************************************
. 
. insheet using https://archive.ics.uci.edu/ml/machine-learning-databases/spambase/spam
> base.data, clear comma
(58 vars, 4,601 obs)

. 
. local m1 logit lassocv gradboost nnet

. local m2 logit lassocv rf nnet

. local m3 logit ridgecv gradboost nnet

. local m4 logit elasticcv gradboost nnet

. local m5 logit elasticcv gradboost svm

. local m6 logit elasticcv gradboost linsvm

. 
. foreach m in "`m1'" "`m2'" "`m3'" "`m4'" "`m5'" "`m6'" {
  2.         di "`m'"
  3.         pystacked v58 v1-v57, type(class) pyseed(123) ///
>                                                         methods(`m') /// 
>                                                         njobs(4)
  4. }
logit lassocv gradboost nnet
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0000000
  lassocv        |      0.0000000
  gradboost      |      0.7878810
  nnet           |      0.2121190
logit lassocv rf nnet
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0267907
  lassocv        |      0.0000000
  rf             |      0.6782659
  nnet           |      0.2949433
logit ridgecv gradboost nnet
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0000000
  ridgecv        |      0.0989914
  gradboost      |      0.7587292
  nnet           |      0.1422794
logit elasticcv gradboost nnet
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0000000
  elasticcv      |      0.0000000
  gradboost      |      0.7878810
  nnet           |      0.2121190
logit elasticcv gradboost svm
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0995828
  elasticcv      |      0.0000000
  gradboost      |      0.8915383
  svm            |      0.0088790
logit elasticcv gradboost linsvm
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0863488
  elasticcv      |      0.0000000
  gradboost      |      0.9117318
  linsvm         |      0.0019194

. 
. *******************************************************************************
. *** check that predicted value = weighted avg of transform variables            ***
. *******************************************************************************
.                                                  
. insheet using https://archive.ics.uci.edu/ml/machine-learning-databases/spambase/spam
> base.data, clear comma
(58 vars, 4,601 obs)

. 
. pystacked v58 v1-v57, type(class) pyseed(123)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0971791
  lassocv        |      0.0000000
  gradboost      |      0.9028209

. 
. predict double yhat, pr

. list yhat if _n < 10

      +-----------+
      |      yhat |
      |-----------|
   1. | .94831697 |
   2. | .97696701 |
   3. |  .9929331 |
   4. | .95494432 |
   5. |  .9549296 |
      |-----------|
   6. | .65930511 |
   7. | .88424077 |
   8. | .65927345 |
   9. | .98872205 |
      +-----------+

. 
. predict double t, transform  
pr
pr
pr

. 
. mat W = e(weights)

. gen myhat = t0*el(W,1,1)+t1*el(W,2,1)+t2*el(W,3,1)
t0 not found
r(111);

end of do-file

r(111);

. do "C:\Users\ecomes\AppData\Local\Temp\STD34f0_000000.tmp"

. gen myhat = t1*el(W,1,1)+t2*el(W,2,1)+t3*el(W,3,1)

. 
. assert reldif(yhat,myhat)<0.0001

. 
. 
. *******************************************************************************
. *** check table option                                                               
>                                            ***
. *******************************************************************************
. 
. insheet using https://archive.ics.uci.edu/ml/machine-learning-databases/spambase/spam
> base.data, clear comma
(58 vars, 4,601 obs)

. 
. // holdout sample 1
. cap drop h1

. gen h1 = _n>3000

. 
. // full sample
. pystacked v58 v1-v57, type(class) pyseed(123) methods(logit rf gradboost)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0667665
  rf             |      0.2698256
  gradboost      |      0.6634079

. pystacked, table
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0667665
  rf             |      0.2698256
  gradboost      |      0.6634079

Confusion matrix: In-Sample and Out-of-Sample
------------------------------------------------------------
  Method         | Weight      In-Sample       Out-of-Sample
                 |             0       1         0       1  
-----------------+------------------------------------------
  STACKING     0 |    .      2746      42         .       .
  STACKING     1 |    .        70    1743         .       .
  logit        0 | 0.067     2622     166         .       .
  logit        1 | 0.067      193    1620         .       .
  rf           0 | 0.270     2787       1         .       .
  rf           1 | 0.270        2    1811         .       .
  gradboost    0 | 0.663     2716      72         .       .
  gradboost    1 | 0.663       99    1714         .       .

. 
. // with holdout sample
. pystacked v58 v1-v57 if _n<2000, type(class) pyseed(123) methods(logit rf gradboost)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

. // default holdout - all available obs
. pystacked, table holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

Confusion matrix: In-Sample and Out-of-Sample
------------------------------------------------------------
  Method         | Weight      In-Sample       Out-of-Sample
                 |             0       1         0       1  
-----------------+------------------------------------------
  STACKING     0 |    .       170      16      1715     887
  STACKING     1 |    .         6    1807         0       0
  logit        0 | 0.170      134      52      1455    1147
  logit        1 | 0.170        8    1805         0       0
  rf           0 | 0.030      185       1      1733     869
  rf           1 | 0.030        0    1813         0       0
  gradboost    0 | 0.800      171      15      1719     883
  gradboost    1 | 0.800        6    1807         0       0

. // specified holdout sample
. pystacked, table holdout(h1)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 1601

Confusion matrix: In-Sample and Out-of-Sample
------------------------------------------------------------
  Method         | Weight      In-Sample       Out-of-Sample
                 |             0       1         0       1  
-----------------+------------------------------------------
  STACKING     0 |    .       170      16       944     657
  STACKING     1 |    .         6    1807         0       0
  logit        0 | 0.170      134      52       773     828
  logit        1 | 0.170        8    1805         0       0
  rf           0 | 0.030      185       1       946     655
  rf           1 | 0.030        0    1813         0       0
  gradboost    0 | 0.800      171      15       947     654
  gradboost    1 | 0.800        6    1807         0       0

. 
. // as pystacked option
. pystacked v58 v1-v57 if _n<2000, type(class) pyseed(123) ///
>         methods(logit rf gradboost) table holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

Confusion matrix: In-Sample and Out-of-Sample
------------------------------------------------------------
  Method         | Weight      In-Sample       Out-of-Sample
                 |             0       1         0       1  
-----------------+------------------------------------------
  STACKING     0 |    .       170      16      1715     887
  STACKING     1 |    .         6    1807         0       0
  logit        0 | 0.170      134      52      1455    1147
  logit        1 | 0.170        8    1805         0       0
  rf           0 | 0.030      185       1      1733     869
  rf           1 | 0.030        0    1813         0       0
  gradboost    0 | 0.800      171      15      1719     883
  gradboost    1 | 0.800        6    1807         0       0

. 
. // syntax 2
. pystacked v58 v1-v57 if _n<2000 || method(logit) || method(rf) || method(gradboost), 
> ///
>         type(class) pyseed(123)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

. pystacked, table holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

Confusion matrix: In-Sample and Out-of-Sample
------------------------------------------------------------
  Method         | Weight      In-Sample       Out-of-Sample
                 |             0       1         0       1  
-----------------+------------------------------------------
  STACKING     0 |    .       170      16      1715     887
  STACKING     1 |    .         6    1807         0       0
  logit        0 | 0.170      134      52      1455    1147
  logit        1 | 0.170        8    1805         0       0
  rf           0 | 0.030      185       1      1733     869
  rf           1 | 0.030        0    1813         0       0
  gradboost    0 | 0.800      171      15      1719     883
  gradboost    1 | 0.800        6    1807         0       0

. 
. 
. *******************************************************************************
. *** check graph option                                                               
>                                            ***
. *******************************************************************************
. 
. insheet using https://archive.ics.uci.edu/ml/machine-learning-databases/spambase/spam
> base.data, clear comma
(58 vars, 4,601 obs)

. 
. // holdout sample 1
. cap drop h1

. gen h1 = _n>3000

. 
. // full sample
. pystacked v58 v1-v57, type(class) pyseed(123) methods(logit rf gradboost)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0667665
  rf             |      0.2698256
  gradboost      |      0.6634079

. pystacked, graph
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.0667665
  rf             |      0.2698256
  gradboost      |      0.6634079

. 
. // with holdout sample
. pystacked v58 v1-v57 if _n<2000, type(class) pyseed(123) methods(logit rf gradboost)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

. // default holdout - all available obs
. pystacked, graph holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. // specified holdout sample
. pystacked, graph holdout(h1)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 1601

. // histogram option
. pystacked, graph hist holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. // graphing options - combined graph
. pystacked, graph(subtitle("subtitle goes here")) holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. // graphing options - learner graphs
. pystacked, lgraph(percent) hist holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. 
. // as pystacked option
. pystacked v58 v1-v57 if _n<2000, type(class) pyseed(123) ///
>         methods(logit rf gradboost) graph holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. 
. // syntax 2
. pystacked v58 v1-v57 if _n<2000 || method(logit) || method(rf) || method(gradboost), 
> ///
>         type(class) pyseed(123)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

. pystacked, graph holdout
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  logit          |      0.1702227
  rf             |      0.0302334
  gradboost      |      0.7995439

Number of holdout observations: 2602

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\ecomes\Documents\GitHub\pystacked\cert\log_cs_pystacked_class.txt
  log type:  text
 closed on:  26 Oct 2021, 22:26:11
---------------------------------------------------------------------------------------
