-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/pystacked/cert/log_cs_pystacked_reg.txt
  log type:  text
 opened on:   3 Oct 2021, 15:04:15

. 
. clear all

.  
. net install pystacked, ///
>                 from(https://raw.githubusercontent.com/aahrens1/pystacked/main) replace
checking pystacked consistency and verifying not already installed...
all files already exist and are up to date.

. which pystacked 
/Users/kahrens/Library/Application Support/Stata/ado/plus/p/pystacked.ado
*! pystacked v0.1 (first release)
*! last edited: 3oct2021
*! authors: aa/ms

. python: import sklearn

. python: sklearn.__version__
'1.0'

. 
. global xvars lcavol lweight age lbph svi lcp gleason pgg45

. 
. *******************************************************************************
. *** voting                                                                                         
>                                              ***
. *******************************************************************************
. 
. clear

. insheet using https://web.stanford.edu/~hastie/ElemStatLearn/datasets/prostate.data,  tab clear
(11 vars, 97 obs)

. 
. set seed 124345

. 
. pystacked lpsa $xvars, ///
>                                                  type(regress) pyseed(243) ///
>                                                  methods(ols lassoic rf) ///
>                                                  pipe1(poly2) pipe2(poly2) /// 
>                                                  voting voteweights(.5 .1)
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  ols            |      0.5000000
  lassoic        |      0.1000000
  rf             |      0.4000000

. 
. // should cause error
. cap pystacked lpsa $xvars, ///
>                                                  type(regress) pyseed(243) ///
>                                                  methods(ols lassoic rf) ///
>                                                  pipe1(poly2) pipe2(poly2) /// 
>                                                  voting voteweights(.5 .9)      

.                                                  
. *******************************************************************************
. *** check pipeline                                                                                 
>                                      ***
. *******************************************************************************
. 
. clear

. insheet using https://web.stanford.edu/~hastie/ElemStatLearn/datasets/prostate.data,  tab clear
(11 vars, 97 obs)

. 
. set seed 124345

. 
. 
. pystacked lpsa $xvars, ///
>                                                  type(regress) pyseed(243) ///
>                                                  methods(ols lassoic rf) ///
>                                                  pipe1(poly2) pipe2(poly2) 
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  ols            |      0.1133240
  lassoic        |      0.6204051
  rf             |      0.2662709

. predict a, transf
command pystacked_p is unrecognized
r(199);

end of do-file

r(199);

. ereturn list

scalars:
             e(mcount) =  3

macros:
              e(pipe3) : "passthrough"
             e(pyopt3) : "{'n_estimators':100,'criterion':'mse','max_depth':None,'min_samples_spl.."
            e(method3) : "rf"
              e(pipe2) : "poly2"
             e(pyopt2) : "{'criterion':'aic','fit_intercept':True,'max_iter':500,'positive':False}"
            e(method2) : "lassoic"
              e(pipe1) : "poly2"
             e(pyopt1) : "{'fit_intercept':True,'normalize':True,'positive':False}"
            e(method1) : "ols"
             e(depvar) : "lpsa"
            e(predict) : "pystacked_p"
                e(cmd) : "pystacked"
         e(python_ver) : "3.9.5 (default, May  4 2021, 03:33:11) 
[Clang 12.0.0 (clang-1200.0.32..."
          e(scipy_ver) : "1.6.3"
          e(numpy_ver) : "1.20.3"
        e(sklearn_ver) : "1.0"
           e(base_est) : "ols lassoic rf"

matrices:
            e(weights) :  3 x 1

. which pystacked_p
command pystacked_p not found as either built-in or ado-file
r(111);

